<?php
error_reporting(0);
$msg = $_REQUEST["msg"];
function get_rwid($msg) {
	$id = array(
		"艾琳" => 155,
		"阿古朵" => 533,
		"阿轲" => 116,
		"安琪拉" => 142,
		"白起" => 120,
		"百里守约" => 196,
		"百里玄策" => 195,
		"扁鹊" => 119,
		"蔡文姬" => 184,
		"曹操" => 128,
		"成吉思汗" => 141,
		"程咬金" => 144,
		"嫦娥" => 515,
		"达摩" => 134,
		"妲己" => 109,
		"大乔" => 191,
		"狄仁杰" => 133,
		"典韦" => 129,
		"貂蝉" => 141,
		"东皇太一" => 187,
		"暃" => 542,
		"干将莫邪" => 182,
		"高渐离" => 115,
		"公孙离" => 199,
		"关羽" => 140,
		"鬼谷子" => 189,
		"宫本武藏" => 130,
		"伽罗" => 508,
		"戈娅" => 548,
		"韩信" => 150,
		"后羿" => 169,
		"花木兰" => 154,
		"黄忠" => 192,
		"金蝉" => 540,
		"姜子牙" => 148,
		"镜" => 531,
		"铠" => 193,
		"狂铁" => 583,
		"澜" => 528,
		"兰陵王" => 153,
		"李白" => 131,
		"老夫子" => 139,
		"李元芳" => 173,
		"廉颇" => 105,
		"刘邦" => 149,
		"刘备" => 170,
		"刘禅" => 114,
		"鲁班大师" => 525,
		"鲁班" => 112,
		"露娜" => 146,
		"吕布" => 123,
		"李信" => 507,
		"马可波罗" => 132,
		"蒙犽" => 524,
		"蒙恬" => 527,
		"米莱迪" => 504,
		"马超" => 518,
		"芈月" => 121,
		"明世隐" => 501,
		"墨子" => 108,
		"哪吒" => 180,
		"牛魔" => 168,
		"女娲" => 179,
		"盘古" => 529,
		"裴擒虎" => 502,
		"上官婉儿" => 513,
		"沈梦溪" => 312,
		"司马懿" => 137,
		"苏烈" => 194,
		"孙膑" => 118,
		"孙悟空" => 167,
		"孙策" => 510,
		"孙尚香" => 111,
		"司空震" => 537,
		"桑启" => 534,
		"太乙真人" => 186,
		"王昭君" => 152,
		"武则天" => 136,
		"夏侯敦" => 126,
		"项羽" => 135,
		"小乔" => 106,
		"西施" => 523,
		"夏洛特" => 536,
		"瑶" => 505,
		"曜" => 522,
		"云中君" => 506,
		"雅典娜" => 183,
		"云缨" => 538,
		"亚瑟" => 166,
		"杨戬" => 178,
		"杨玉环" => 176,
		"弈星" => 197,
		"嬴政" => 110,
		"虞姬" => 174,
		"元歌" => 125,
		"张飞" => 171,
		"张良" => 156,
		"赵云" => 107,
		"甄姬" => 127,
		"钟馗" => 175,
		"钟无艳" => 117,
		"周瑜" => 124,
		"诸葛亮" => 190,
		"猪八戒" => 511,
		"庄周" => 113,
	);
	return $id[$msg];
}
$rw=get_rwid($msg);
$url=file_get_contents("https://pvp.qq.com/zlkdatasys/storyhero/index".$rw.".json");
$data=preg_match_all('/{"yywa1_f2":"(.*?)","yyyp_9a":"(.*?)"}/',$url,$list);
function unicodeDecode($aa) {
	$json = '{"str":"'.$aa.'"}';
	$arr = json_decode($json,true);
	if(empty($arr)) return '';
	return $arr['str'];
}
if($msg == null) {
	$Json = array('code' => -1, 'msg' => '请输入要查询的英雄');
} else {
	if($rw == null) {
		$Json = array('code' => -1, 'msg' => '王者英雄不存在');
	} else {
		for ($i=0; $i <$data ; $i++) {
			$ii = $i+1;
			$aa=$list[1][$i];
			$aa=unicodeDecode($aa);
			$bb=$list[2][$i];
			$bb=str_replace("\/","/",$bb);
			$array[] = array('id' => $ii, 'lines' =>$aa, 'voice' =>'https:'.$bb);
		}
		$Json = array(
			'code' => 1,
			'msg' => '获取成功',
			'hero' => $msg,
			'count' => count($array),
			'img'  => 'https://game.gtimg.cn/images/yxzj/img201606/skin/hero-info/'.$rw.'/'.$rw.'-bigskin-1.jpg',
			'data' => $array
		);
	}
}
header('Content-Type:application/json');
$Json = json_encode($Json,JSON_PRETTY_PRINT|JSON_UNESCAPED_UNICODE);
echo stripslashes($Json);
return $Json;
?>